In [244]:
from sklearn.linear_model import LogisticRegression
import pandas as pd
import csv
data=pd.read_csv('titanic_x_y_train.csv',delimiter=',')
data.shape

(668, 11)

In [245]:
x_train=data.iloc[:,:10]
y_train=data.iloc[:,-1]

In [246]:
x_train.isnull().sum()

Pclass        0
Name          0
Sex           0
Age         132
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       514
Embarked      1
dtype: int64

In [247]:
x_train.Age.fillna(data.Age.mean(), inplace = True)
x_train.drop('Cabin',axis=1,inplace=True)
x_train.Embarked.fillna(data.Embarked.value_counts().idxmax(), inplace = True)

In [248]:
x_train.isnull().sum()

Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
dtype: int64

In [249]:
x_train.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.00000,1,0,228414,26.000,S
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,29.70056,0,0,A/5 2466,8.050,S
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.00000,0,0,250655,26.000,S
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.00000,0,4,349909,21.075,S
4,3,"Sutehall, Mr. Henry Jr",male,25.00000,0,0,SOTON/OQ 392076,7.050,S

In [250]:
# converting categorical attribute Sex to numeral value
def func_Sex(s):
    if s == 'male':
        return 0
    return 1
x_train['sex'] = x_train['Sex'].apply(func_Sex)
x_train.drop('Sex', axis = 1, inplace = True)
x_train.head()

,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Embarked,sex
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",29.00000,1,0,228414,26.000,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",29.70056,0,0,A/5 2466,8.050,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",39.00000,0,0,250655,26.000,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",29.00000,0,4,349909,21.075,S,1
4,3,"Sutehall, Mr. Henry Jr",25.00000,0,0,SOTON/OQ 392076,7.050,S,0

In [251]:
x_train.drop('Name', axis = 1, inplace = True)
x_train.drop('Ticket', axis = 1, inplace = True)

In [252]:
x_train.head()

   Pclass       Age  SibSp  Parch    Fare Embarked  sex
0       2  29.00000      1      0  26.000        S    1
1       3  29.70056      0      0   8.050        S    0
2       2  39.00000      0      0  26.000        S    0
3       3  29.00000      0      4  21.075        S    1
4       3  25.00000      0      0   7.050        S    0

In [253]:
# converting categorical attribute Embarked to numeral value
def func_Embark(s):
    if s == 'S':
        return 0
    elif s == 'C':
        return 1
    else:
        return 2
x_train['Embark'] = x_train['Embarked'].apply(func_Embark)
x_train.drop('Embarked', axis = 1, inplace = True)
x_train.head()

   Pclass       Age  SibSp  Parch    Fare  sex  Embark
0       2  29.00000      1      0  26.000    1       0
1       3  29.70056      0      0   8.050    0       0
2       2  39.00000      0      0  26.000    0       0
3       3  29.00000      0      4  21.075    1       0
4       3  25.00000      0      0   7.050    0       0

In [254]:
# saving cleaned data to respective csv files
x_train.to_csv('x_train_clean.csv', index = False)

In [255]:
train = pd.read_csv('x_train_clean.csv')

In [256]:
train_x = train.values
train_y=y_train.values
train_x.shape

(668, 7)

In [257]:
# adding dummy data
df = pd.DataFrame(train_x)
N = df.shape[1]
count = N
for i in range(N):
    for j in range(i, N):
        df[count] = df[df.columns[i]] * df[df.columns[j]]
        count += 1

df.head()

,0,1,2,3,4,5,6,7,8,9,...,25,26,27,28,29,30,31,32,33,34
0,2.0,29.00000,1.0,0.0,26.000,1.0,0.0,4.0,58.000000,2.0,...,0.0,0.0,0.0,0.0,676.000000,26.000,0.0,1.0,0.0,0.0
1,3.0,29.70056,0.0,0.0,8.050,0.0,0.0,9.0,89.101679,0.0,...,0.0,0.0,0.0,0.0,64.802500,0.000,0.0,0.0,0.0,0.0
2,2.0,39.00000,0.0,0.0,26.000,0.0,0.0,4.0,78.000000,0.0,...,0.0,0.0,0.0,0.0,676.000000,0.000,0.0,0.0,0.0,0.0
3,3.0,29.00000,0.0,4.0,21.075,1.0,0.0,9.0,87.000000,0.0,...,16.0,84.3,4.0,0.0,444.155625,21.075,0.0,1.0,0.0,0.0
4,3.0,25.00000,0.0,0.0,7.050,0.0,0.0,9.0,75.000000,0.0,...,0.0,0.0,0.0,0.0,49.702500,0.000,0.0,0.0,0.0,0.0

In [258]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
df_new = scaler.fit_transform(df)

In [259]:
df.shape

(668, 35)

In [260]:
train_x =df_new
train_x.shape

(668, 35)

In [261]:
# training data with LogisticRegressionCV
from sklearn.linear_model import LogisticRegression
clf = LogisticRegression( random_state=5,solver='liblinear', max_iter = 300)
clf.fit(train_x, train_y)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=300,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=5, solver='liblinear', tol=0.0001, verbose=0,
                   warm_start=False)

In [262]:
clf.score(train_x, train_y)

0.8293413173652695

In [263]:
data=pd.read_csv('titanic_x_test.csv',delimiter=',')
data.shape

(223, 10)

In [264]:
data.isnull().sum()

Pclass        0
Name          0
Sex           0
Age          45
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       173
Embarked      1
dtype: int64

In [265]:
data.Age.fillna(data.Age.mean(), inplace = True)
data.drop('Cabin',axis=1,inplace=True)

In [266]:
data.Embarked.fillna(data.Embarked.value_counts().idxmax(), inplace = True)

In [267]:
data.isnull().sum()

Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
dtype: int64

In [268]:
data.drop('Name', axis = 1, inplace = True)
data.drop('Ticket', axis = 1, inplace = True)

In [269]:
# converting categorical attribute Sex to numeral value
def func_Sex(s):
    if s == 'male':
        return 0
    return 1
data['sex'] = data['Sex'].apply(func_Sex)
data.drop('Sex', axis = 1, inplace = True)
data.head()

   Pclass        Age  SibSp  Parch     Fare Embarked  sex
0       2   8.000000      1      1  36.7500        S    0
1       1  49.000000      0      0  25.9292        S    1
2       3  29.694775      0      0   7.7375        Q    0
3       2  24.000000      2      1  27.0000        S    1
4       1  36.000000      0      0  26.2875        S    0

In [270]:
# converting categorical attribute Embarked to numeral value
def func_Embark(s):
    if s == 'S':
        return 0
    elif s == 'C':
        return 1
    else:
        return 2
data['Embark'] = data['Embarked'].apply(func_Embark)
data.drop('Embarked', axis = 1, inplace = True)
data.head()

   Pclass        Age  SibSp  Parch     Fare  sex  Embark
0       2   8.000000      1      1  36.7500    0       0
1       1  49.000000      0      0  25.9292    1       0
2       3  29.694775      0      0   7.7375    0       2
3       2  24.000000      2      1  27.0000    1       0
4       1  36.000000      0      0  26.2875    0       0

In [271]:
df = pd.DataFrame(data)
N = df.shape[1]
count = N
for i in range(N):
    for j in range(i, N):
        df[count] = df[df.columns[i]] * df[df.columns[j]]
        count += 1

In [272]:
test_x = scaler.transform(df)

In [273]:
test_y_pred = clf.predict(test_x).astype(float)

In [274]:
# saving cleaned data to respective csv files
submission = pd.DataFrame(test_y_pred)
submission.to_csv('y_predictions.csv',header=False, index = False)